Code-Newborn/STM32_nRF24L01/STM32F407VGT6_Receiver/HARDWARE/NRF24L01/nRF24L01P.c
#include "nRF24L01P.h"
#include "usart.h"
#include <stdlib.h>
HAL_StatusTypeDef HAL_nRF24L01P_Init( nRF24L01P* nRF ) {
    /* ---- Local Vars. ---- */
    uint8_t           regValue;
    HAL_StatusTypeDef retValue = HAL_OK;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_PowerUP( nRF, nRF_ENABLE ) != HAL_OK ) {
        return HAL_ERROR;
    }

    do {
        if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
            return HAL_ERROR;
        }
    } while ( ( regValue & 0x02 ) == 0x00 );  // Did device powered up?

    /* ---- InitProcess ---- */
    retValue |= HAL_nRF24L01P_SetPRXWidth( nRF, nRF->PayloadWidth, nRF_DATA_PIPE_0 );
    retValue |= HAL_nRF24L01P_SetPRXAddress( nRF, nRF->RX_Address, nRF_DATA_PIPE_0 );
    retValue |= HAL_nRF24L01P_SetPTXAddress( nRF, nRF->TX_Address );
    retValue |= HAL_nRF24L01P_RXDataReadyIRQ( nRF, nRF_ENABLE );
    retValue |= HAL_nRF24L01P_TXDataSentIRQ( nRF, nRF_ENABLE );
    retValue |= HAL_nRF24L01P_MaxReTransmitIRQ( nRF, nRF_ENABLE );
    retValue |= HAL_nRF24L01P_CRC( nRF, nRF_ENABLE );
    retValue |= HAL_nRF24L01P_SetCRCWidth( nRF, nRF->CRC_Width );
    retValue |= HAL_nRF24L01P_SetAddressWidth( nRF, nRF->ADDR_Width );
    retValue |= HAL_nRF24L01P_SetRFChannel( nRF, nRF->RF_Channel );
    retValue |= HAL_nRF24L01P_SetDataRate( nRF, nRF->Data_Rate );
    retValue |= HAL_nRF24L01P_SetRetransmissionCount( nRF, nRF->RetransmitCount );
    retValue |= HAL_nRF24L01P_SetRetransmissionDelay( nRF, nRF->RetransmitDelay );

    retValue |= HAL_nRF24L01P_DynACK( nRF, nRF_ENABLE );
    retValue |= HAL_nRF24L01P_ACKPayload( nRF, nRF_ENABLE );
    retValue |= HAL_nRF24L01P_DynPayload( nRF, nRF_ENABLE );

    retValue |= HAL_nRF24L01P_RXPipe( nRF, nRF_DATA_PIPE_0, nRF_ENABLE );
    retValue |= HAL_nRF24L01P_DPLPipe( nRF, nRF_DATA_PIPE_0, nRF_ENABLE );

    retValue |= HAL_nRF24L01P_AutoACK( nRF, nRF_DATA_PIPE_0, nRF_ENABLE );
    retValue |= HAL_nRF24L01P_AutoACK( nRF, nRF_DATA_PIPE_1, nRF_DISABLE );
    retValue |= HAL_nRF24L01P_AutoACK( nRF, nRF_DATA_PIPE_2, nRF_DISABLE );
    retValue |= HAL_nRF24L01P_AutoACK( nRF, nRF_DATA_PIPE_3, nRF_DISABLE );
    retValue |= HAL_nRF24L01P_AutoACK( nRF, nRF_DATA_PIPE_4, nRF_DISABLE );
    retValue |= HAL_nRF24L01P_AutoACK( nRF, nRF_DATA_PIPE_5, nRF_DISABLE );

    retValue |= HAL_nRF24L01P_ClearInterrupts( nRF );

    retValue |= HAL_nRF24L01P_TXRX( nRF, nRF_STATE_RX );
    retValue |= HAL_nRF24L01P_FlushRX( nRF );

    if ( retValue != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_IRQ_Handler( nRF24L01P* nRF ) {
    /* ---- Local Vars. ---- */
    uint8_t regStatus;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_STATUS, &regStatus ) != HAL_OK ) {
        return HAL_ERROR;
    }
    /* ---- RX FIFO Int.---- */
    if ( ( regStatus & ( 1 << 6 ) ) != 0 ) {
        uint8_t regFIFO_Status;
        HAL_nRF24L01P_CE_Low( nRF );
        do {
            HAL_nRF24L01P_ReadRXPayload( nRF, nRF->RX_Buffer );
            regStatus |= ( 1 << 6 );
            HAL_nRF24L01P_WriteRegister( nRF, nRF_STATUS, &regStatus );
            HAL_nRF24L01P_ReadRegister( nRF, nRF_FIFO_STATUS, &regFIFO_Status );
        } while ( ( regFIFO_Status & 0x01 ) == 0x00 );
        HAL_nRF24L01P_CE_High( nRF );
    }
    /* ---- TX Sent Int.---- */
    if ( ( regStatus & ( 1 << 5 ) ) != 0 ) {
        HAL_nRF24L01P_CE_Low( nRF );
        regStatus |= ( 1 << 5 );
        HAL_nRF24L01P_TXRX( nRF, nRF_STATE_RX );
        HAL_nRF24L01P_WriteRegister( nRF, nRF_STATUS, &regStatus );
        HAL_nRF24L01P_CE_High( nRF );
        nRF->Busy = 0;
    }
    /* ---- MAXReTX Int.---- */
    if ( ( regStatus & ( 1 << 4 ) ) != 0 ) {
        regStatus |= ( 1 << 4 );

        HAL_nRF24L01P_FlushTX( nRF );
        HAL_nRF24L01P_PowerUP( nRF, nRF_DISABLE );  // bi kapatip açalim da düzelsin...
        HAL_nRF24L01P_PowerUP( nRF, nRF_ENABLE );

        HAL_nRF24L01P_CE_Low( nRF );
        HAL_nRF24L01P_TXRX( nRF, nRF_STATE_RX );
        HAL_nRF24L01P_WriteRegister( nRF, nRF_STATUS, &regStatus );
        HAL_nRF24L01P_CE_High( nRF );
        nRF->Busy = 0;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_ReceivePacket( nRF24L01P* nRF, uint8_t* Data ) {
    nRF->Busy = 1;

    HAL_nRF24L01P_CE_Low( nRF );
    HAL_nRF24L01P_TXRX( nRF, nRF_STATE_RX );
    HAL_nRF24L01P_CE_High( nRF );

    while ( nRF->Busy )
        ;  // TODO: Add *timeout* functionality

    for ( uint8_t i = 0; i < nRF->PayloadWidth; i++ ) {
        Data[ i ] = nRF->RX_Buffer[ i ];
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_TransmitPacket( nRF24L01P* nRF, uint8_t* Data ) {
    nRF->Busy = 1;

    HAL_nRF24L01P_CE_Low( nRF );
    HAL_nRF24L01P_TXRX( nRF, nRF_STATE_TX );
    HAL_nRF24L01P_WriteTXPayload( nRF, Data );
    HAL_nRF24L01P_CE_High( nRF );

    while ( nRF->Busy )
        ;  // TODO: Add *timeout* functionality
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_TransmitPacketACK( nRF24L01P* nRF, uint8_t* Data, nRF_DATA_PIPE Pipe ) {
    nRF->Busy = 1;

    HAL_nRF24L01P_CE_Low( nRF );
    HAL_nRF24L01P_TXRX( nRF, nRF_STATE_TX );
    HAL_nRF24L01P_WriteTXPayloadACK( nRF, Data, Pipe );
    HAL_nRF24L01P_CE_High( nRF );

    while ( nRF->Busy )
        ;  // TODO: Add *timeout* functionality
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_SetPRXWidth( nRF24L01P* nRF, nRF_PRX_WIDTH Width, nRF_DATA_PIPE Pipe ) {
    /* ---- Local Vars. ---- */
    uint8_t regAddr, regData;
    regData = Width & 0x3F;
    /* ---- Pre Process ---- */
    switch ( Pipe ) {
    case 0:  // P0
        regAddr = nRF_RX_PW_P0;
        break;
    case 1:  // P1
        regAddr = nRF_RX_PW_P1;
        break;
    case 2:  // P2
        regAddr = nRF_RX_PW_P2;
        break;
    case 3:  // P3
        regAddr = nRF_RX_PW_P3;
        break;
    case 4:  // P4
        regAddr = nRF_RX_PW_P4;
        break;
    case 5:  // P5
        regAddr = nRF_RX_PW_P5;
        break;
    default:
        return HAL_ERROR;
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, regAddr, &regData ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_SetPTXAddress( nRF24L01P* nRF, uint8_t* pRegData ) {
    /* ---- Local Vars. ---- */
    uint8_t Zero[ 5 ];
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_SendCommand( nRF, nRF_CMD_W_REGISTER + nRF_TX_ADDR, pRegData, Zero, 5 ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_SetPRXAddress( nRF24L01P* nRF, uint8_t* pRegData, nRF_DATA_PIPE Pipe ) {
    /* ---- Local Vars. ---- */
    uint8_t Zero[ 5 ];
    uint8_t Size;
    uint8_t regAddr;
    /* ---- Pre Process ---- */
    switch ( Pipe ) {
    case 0:  // P0
        Size    = 5;
        regAddr = nRF_RX_ADDR_P0;
        break;
    case 1:  // P1
        Size    = 5;
        regAddr = nRF_RX_ADDR_P1;
        break;
    case 2:  // P2
        Size    = 1;
        regAddr = nRF_RX_ADDR_P2;
        break;
    case 3:  // P3
        Size    = 1;
        regAddr = nRF_RX_ADDR_P3;
        break;
    case 4:  // P4
        Size    = 1;
        regAddr = nRF_RX_ADDR_P4;
        break;
    case 5:  // P5
        Size    = 1;
        regAddr = nRF_RX_ADDR_P5;
        break;
    default:
        return HAL_ERROR;
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_SendCommand( nRF, nRF_CMD_W_REGISTER + regAddr, pRegData, Zero, Size ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

