Code-Newborn/STM32_nRF24L01/STM32F407VGT6_Receiver/HARDWARE/NRF24L01/nRF24L01P.c
    Pipe &= ( 0x3F );  // nRF_EN_RXADDR reg's 7. bit is Reserved
    if ( Pipe_State ) {
        regValue |= ( 1 << Pipe );
    }
    else {
        regValue &= ~( 1 << Pipe );
    }  // nRF_EN_RXADDR reg is Configured

    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_EN_RXADDR, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_SetAddressWidth( nRF24L01P* nRF, nRF_ADDR_WIDTH AddrWidth ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_SETUP_AW, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    AddrWidth &= ( 0x03 );
    regValue &= ( 0xFC );       // nRF_SETUP_AW reg's 0, 1 and 2. bits are Cleared
    regValue |= ( AddrWidth );  // nRF_SETUP_AW reg's 0, 1 and 2. bits are Configured

    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_SETUP_AW, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_SetRetransmissionDelay( nRF24L01P* nRF, nRF_RETX_DELAY Delay ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_SETUP_RETR, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    Delay &= ( 0x0F );
    regValue &= ( 0x0F );        // nRF_SETUP_RETR reg's 4, 5, 6 and 7. bits are Cleared
    regValue |= ( Delay << 4 );  // nRF_SETUP_RETR reg's 4, 5, 6 and 7. bits are Configured

    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_SETUP_RETR, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_SetRetransmissionCount( nRF24L01P* nRF, nRF_RETX_COUNT Count ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_SETUP_RETR, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    Count &= ( 0x0F );
    regValue &= ( 0xF0 );   // nRF_SETUP_RETR reg's 0, 1, 2 and 3. bits are Cleared
    regValue |= ( Count );  // nRF_SETUP_RETR reg's 0, 1, 2 and 3. bits are Configured

    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_SETUP_RETR, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_SetRFChannel( nRF24L01P* nRF, uint8_t Channel ) {
    /* ---- Pre Process ---- */
    Channel &= 0x7F;  // nRF_RF_CH 7. bit is RESERVED
                      // Freq. = (2400 + "Channel" Value) MHz
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_RF_CH, &Channel ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_ClearInterrupts( nRF24L01P* nRF ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_STATUS, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    regValue |= ( 0x07 << 4 );  // nRF_STATUS reg's 4.,5. and 6. bits are RESET

    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_STATUS, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_SetContinuousWave( nRF24L01P* nRF, nRF_STATE ContWave ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_RF_SETUP, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    if ( ContWave ) {
        regValue |= 0x80;  // nRF_RF_SETUP reg's 7. bit (CONT_WAVE) is SET
    }
    else {
        regValue &= 0x7F;  // nRF_RF_SETUP reg's 7. bit (CONT_WAVE) is RESET
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_RF_SETUP, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_SetTXPower( nRF24L01P* nRF, nRF_TX_PWR Power ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_RF_SETUP, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    regValue &= ( 0xF9 );        // nRF_RF_SETUP reg's 1. and 2. bit are RESET
    regValue |= ( Power << 1 );  // nRF_RF_SETUP reg's 1. and 2. bit are Configured
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_RF_SETUP, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_SetDataRate( nRF24L01P* nRF, nRF_DATA_RATE Rate ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_RF_SETUP, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    switch ( Rate ) {
    case nRF_DATA_RATE_250KBPS:
        regValue |= ( 0x01 << 5 );   // nRF_RF_SETUP reg's 5. bit is SET
        regValue &= ~( 0x01 << 3 );  // nRF_RF_SETUP reg's 3. bit is RESET
        break;
    case nRF_DATA_RATE_1MBPS:
        regValue &= ~( 0x01 << 5 );  // nRF_RF_SETUP reg's 5. bit is RESET
        regValue &= ~( 0x01 << 3 );  // nRF_RF_SETUP reg's 3. bit is RESET
        break;
    case nRF_DATA_RATE_2MBPS:
        regValue &= ~( 0x01 << 5 );  // nRF_RF_SETUP reg's 5. bit is RESET
        regValue |= ( 0x01 << 3 );   // nRF_RF_SETUP reg's 3. bit is SET
        break;
    default:
        return HAL_ERROR;
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_RF_SETUP, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_FlushTX( nRF24L01P* nRF ) {
    /* ---- Local Vars. ---- */
    uint8_t Zero = 0x00;
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_SendCommand( nRF, nRF_CMD_FLUSH_TX, &Zero, &Zero, 0 ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_FlushRX( nRF24L01P* nRF ) {
    /* ---- Local Vars. ---- */
    uint8_t Zero = 0x00;
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_SendCommand( nRF, nRF_CMD_FLUSH_RX, &Zero, &Zero, 0 ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

